import random
import time
from datetime import datetime
百家姓 = ['伍', '罗', '秦', '安', '卜', '岑', '马', '皇甫', '柳', '漆雕', '许', '藏', '何', '鲍', '乐'
'雷', '姚', '司徒', '亓官', '梁', '梁丘', '皮', '赫连', '邬', '宰父', '时', '欧阳', '谷梁', '呼延', '孙'
'韦', '子车', '张', '喻', '费', '毛', '汤', '尤', '水', '郭', '段干', '石', '李', '于', '董'
'孟', '卫', '夏侯', '车正', '卞', '严', '蒋', '云', '米', '计', '宇文', '方', '纪', '项', '施'
'屈', '舒', '苏', '元', '常', '徐', '钟', '壤驷', '史', '叶', '司寇', '彭', '林', '东方', '陈'
'江', '金', '余', '伏', '齐', '窦', '康', '傅', '毕', '东郭', '谢', '左丘', '魏', '昌', '朱'
'杜', '诸葛', '穆', '奚', '慕容', '任', '戚', '平', '上官', '冯', '湛', '郝', '长孙', '邹', '陆'
'汪', '闾丘', '茅', '熊', '胡', '潘', '萧', '韩', '刘', '褚', '公良', '柏', '滕', '苗', '顾'
'公西', '凤', '杨', '殷', '宋', '戴', '鲁', '薛', '谈', '狄', '令狐', '羊舌', '闻人', '郑', '崔'
'南宫', '端木', '华', '蔡', '赵', '孔', '姜', '唐', '南门', '北门', '尹', '夹谷', '颛孙', '贺', '贝'
'成', '袁', '庞', '倪', '程', '百里', '花', '黄', '东门', '陶', '微生', '祁', '酆', '巫马', '沈'
'章', '和', '鲜于', '俞', '吕', '曹', '西门', '葛', '范', '廉', '祝', '卢', '王', '郎', '司马'
'司空', '周', '吴', '明', '邵', '拓跋', '禹']

名_list = [
  '伟', '芳', '娜', '敏', '静', '丽', '强', '磊', '军', '洋',
  '子', '欣', '昊', '婷', '雪', '龙', '宇', '嘉', '鹏', '诚',
  '秀', '娟', '杰', '红', '梅', '超', '艳', '波', '薇', '峰',
  '帆', '星', '天', '宇', '轩', '悦', '豪', '斌', '翔', '哲',
  '楠', '皓', '瑞', '杰', '涛', '杰', '鹏', '杰', '泽', '明',
  '磊', '强', '军', '洋', '伟', '秀', '静', '敏', '娜', '丽',
  '煜城', '欣妍', '思源', '依娜', '宇桐', '梓睿', '瑾瑜', '宇泽', '思涵', '煜祺',
  '子墨', '欣悦', '思博', '依婷', '宇轩', '梓涵', '瑾萱', '宇泽', '思琪', '梓睿',
  '煜城', '子瑜', '欣悦', '思远', '依娜', '宇桐', '梓豪', '瑾瑜', '宇辰', '思琪',
  '煜祺', '子萱', '欣然', '思博', '依婷', '宇航', '梓涵', '瑾萱']

select_options = {
        "work_type_arr": {
            "list": [
                "务农",
                "公务员",
                "教师",
                "医生",
                "护士",
                "独立创业者",
                "科技工作者",
                "金融工作者"
            ],
            "desc": "工作类型"
        },
        "marital_status": {
            "list": [
                "未婚",
                "离异",
                "丧偶"
            ],
            "desc": "婚姻状况"
        },
        "borthers_marital_status": {
            "list": [
                "已婚",
                "未婚",
                "离异",
                "丧偶"
            ],
            "desc": "婚姻状况"
        },
        "academic_qualifications_arr": {
            "list": ["初中","高中","技校","职高","中专","大专","本科","研究生","博士","博士后"],
            "desc": "个人学历"
        },
        "brothers_arr": {
            "list": [
                "哥哥",
                "姐姐",
                "弟弟",
                "妹妹"
            ],
            "desc": "兄弟姐妹关系"
        },
        "house_loan_arr": {
            "list": [
                "有房无贷款",
                "有房有贷款",
                "随时可以买房",
                "无房"
            ],
            "desc": "个人资产房产的几种状态"
        },
        "car_loan_arr": {
            "list": [
                "有车无贷款",
                "有车有贷款",
                "随时可以买车",
                "无车"
            ],
            "desc": "个人资产车子的几种状态"
        },
        "parents_work_status": {
            "list": [
                "退休",
                "教师",
                "公职人员",
                "医护人员",
                "打工",
                "个体户",
                "务农",
                "不便透露"
            ],
            "desc": "父母的工作类型"
        },
        "sex_arr": {
            "list": [
                "男",
                "女"
            ],
            "desc": "性别"
        },
        "appearance_arr": {
            "list": [
                "一般",
                "普通",
                "姣好"
            ],
            "desc": "容貌描述"
        },
        "temperament_arr": {
            "list": [
                "外向",
                "内向",
                "乐观",
                "悲观",
                "积极",
                "消极",
                "开朗",
                "严肃",
                "幽默",
                "随和",
                "固执",
                "灵活",
                "死板",
                "冷静",
                "冲动",
                "谨慎",
                "细心",
                "大意",
                "负责",
                "轻率",
                "可靠",
                "耐心",
                "急躁",
                "勤奋",
                "懒惰",
                "诚实",
                "虚伪",
                "真诚",
                "做作",
                "独立",
                "依赖",
                "自信",
                "自卑",
                "谦逊",
                "傲慢",
                "有野心",
                "随遇而安",
                "好奇",
                "热情",
                "冷淡",
                "有创造力",
                "保守",
                "有条理",
                "有同情心",
                "复合型人格"
            ],
            "desc": "性格下拉选项，这个大概率应该用来手写"
        },
        "health_status": {
            "list": [
                "健康",
                "亚健康",
                "有残疾",
                "已故"
            ],
            "desc": "身体情况"
        },
        "request_arr_prefix": {
            "list": [
                "无要求"
            ],
            "desc": "提要求的时候有这个选项前缀"
        },
        "hobbies":{
            "list":["旅游","滑雪","烧菜","看书","书法","钓鱼"],
            "desc":"兴趣爱好"
        },
        "information_arr_suffix": {
            "list": [
                "不便说"
            ],
            "desc": "填写自己信息的时候提供这个选项后缀"
        },
        "drinking": {
            "list": [
                "喝酒",
                "不喝酒",
                "偶尔喝酒"
            ],
            "desc": "填写自己信息的时候提供这个选项后缀"
        },
        "smorking": {
            "list": [
                "抽烟",
                "抽烟",
                "偶尔抽烟"
            ],
            "desc": "填写自己信息的时候提供这个选项后缀"
        }
    }

年龄_列表 = [22, 45]
出生日期="根据年龄推算"
# 照片列表是空，则是否公开和默认显示都是用默认值
照片={
        "照片列表":[],
        "是否公开":["公开","不公开"], #默认 不公开
        "默认显示下标":-1 # 默认-1 
    }
身高_字典={"男":[180,175,170,185,172,183,166],"女":[155,158,162,169,175,160,165],}
体重_字典={"男":[80,60,100,70,65,66,75],"女":[50,46,60,65,57,55,53],}
普通大学 = ["首都师范大学","上海师范大学","南京邮电大学","西南政法大学","东北财经大学","河南大学","河北工业大学","浙江工业大学","广东外语外贸大学","西安建筑科技大学"]
大学_985 = ["北京大学","清华大学","复旦大学","上海交通大学","浙江大学"]
研究生 = ["北京大学","清华大学","复旦大学","上海交通大学","浙江大学"]
博士 = ["北京大学","清华大学","复旦大学","上海交通大学","浙江大学"]

技校 = ["宿迁经贸高等职业技术学校中专部","宿迁卫生学校","江苏宿迁技师学院","宿迁爱迪生中等专业学校","江苏宿豫中等专业学校","江苏省淮海技师学院","沭阳第一技工学校","淮安市商业技工学校","江苏省徐州技师学院","徐州机电技师学院","江苏省徐州市张集中等专业学校","江苏省贾汪中等专业学校","徐州经济技术开发区工业学校",]
中专 = ["宿迁信息工程中等专业学校","宿迁工业中等专业学校","淮安市高级职业技术学校","淮安生物工程高等职业学校","徐州机电工程学校","江苏省徐州市中等专业学校"]
大专 = ["宿迁职业技术学院","宿迁技师学院","江苏联合职业技术学院淮安分院","江苏省淮安技师学院","徐州生物工程职业技术学院","江苏省徐州财经高等职业技术学校"]
职高 = ["宿迁市体育运动学校","宿迁市高级技工学校","淮安市华丰职业技术学校","淮安市辅仁职业技术学校","徐州安保中等专业学校","徐州市博大中等职业学校"]

博士_专业 = ["生物医学工程","材料科学与工程","计算机科学与技术","管理科学与工程"]
本科_专业 = ["金融学","机械工程","电子信息工程","工商管理硕士（MBA）","电气工程","生物技术"]
专科_专业 = ["药品生产技术","新能源汽车技术","建筑工程技术","计算机应用技术"]
职高_专业 = ["机械设计与制造","汽车检测与维修技术","护理","服装设计与工艺"]
学历补充_列表=["大学，专业，学校名称"]

月收入_字典 = { "北京":[9000, 100000],"上海":[9000, 100000],"南京":[7000, 60000],
                "宿迁":[5000, 15000],"沭阳":[5000, 15000]}

年收入_字典 = { "北京":[12, 120],"上海":[12, 120],"南京":[9, 75],
                "宿迁":[6, 19],"沭阳":[6, 19]}
父母月收入_字典 = { "北京":[9000, 30000],"上海":[9000, 30000],"南京":[7000, 15000],
                    "宿迁":[5000, 9000],"沭阳":[5000, 9000]}

工作城市_列表 = ["北京","上海","南京","宿迁","沭阳"]
工作单位_字典 = {
    "南京":["南京笑笑科技有限公司","南京鼓楼钟表店","南京夫子庙老凤祥","中山有限公司"],
    "北京":["北京一起科技有限公司","北京东城区钟表店","北京地坛家具城","西城地铁有限公司"],
    "上海":["波浪科技有限公司","上海徐汇大道喜来登","上海外贸家具城","上海地铁有限公司"],
    "宿迁":["JD科技有限公司","宿迁徐汇大道喜来登","宿迁东城家具城","宿迁YY家政"],
    "沭阳":["沭阳白白织布厂","沭阳汇丰饭店","沭阳城东家具城","沭阳天能电池"]
}
希望安家城市_列表=["北京","上海","南京","宿迁","沭阳"]
兴趣爱好_列表=["旅游","滑雪","烧菜","看书","书法","钓鱼"]
是否喝酒_列表=["喝","不喝"]
是否吸烟_列表=["吸烟","不吸烟"]
车品牌_列表=["大众","比亚迪","奔驰","奥迪","长城","福特","宝马","凯迪拉克","哈佛"]
住址_列表 = ["韩山镇顺河村2组","七雄镇金色江南5栋2003","沭阳县宝拉斯6栋1006","沭阳碧桂园9栋9001","韩山镇大吴村12组","吴集镇xxx村","青伊湖农场xxxx","北丁集xxx村xxx组"]
def 生成指定数量的姓名(num_names=30):
    # 生成指定数量的名字
    names = []
    for _ in range(num_names):
        surname = random.choice(百家姓)
        first_name = random.choice(名_list)
        names.append(surname + first_name)

    return names

def 根据周岁计算出生日期(age):
    '''
    @Time    :   2024/11/06 16:38:44
    @功能    :   None
    '''
    # 获取当前日期
    当前日期 = datetime.now()
    # 计算出生日期
    出生日期 = 当前日期.replace(year=当前日期.year - age)
    print(出生日期.strftime("%Y-%m-%d"))
    return 出生日期.strftime("%Y-%m-%d")

def 根据虚岁计算出生日期(age):
    '''
    @Time    :   2024/11/06 16:39:31
    @功能    :   None
    '''
    # 获取当前日期
    当前日期 = datetime.now()

    # 假设某人的虚岁是25岁
    # 计算出生日期
    出生年份 = 当前日期.year - age + 1  # 虚岁需要加1
    出生日期 = 当前日期.replace(year=出生年份)
    print(出生日期.strftime("%Y-%m-%d"))
    return 出生日期.strftime("%Y-%m-%d")

def 根据出生日期计算周岁和虚岁(出生日期):
    '''
    @Time    :   2024/11/06 16:41:28
    @功能    :   None
    出生日期格式："2000-01-01"
    '''
    # 将字符串解析为 datetime 对象
    出生日期 = datetime.strptime(出生日期, "%Y-%m-%d")
    # 获取当前日期
    当前日期 = datetime.now()
    # 计算周岁
    周岁 = 当前日期.year - 出生日期.year - ((当前日期.month, 当前日期.day) < (出生日期.month, 出生日期.day))
    # 计算虚岁
    虚岁 = 周岁 + 1 if (当前日期.month, 当前日期.day) >= (出生日期.month, 出生日期.day) else 周岁
    print(f"周岁: {周岁}, 虚岁: {虚岁}")
    return {"周岁":周岁,"虚岁":虚岁}
    pass

def 读写json数据(json_file, datas={}, model=0):
    '''
    @Time    :   2024/05/22 13:43:44
    @功能    :   读/写json文件
        model: 
            0:读取数据；1:追加写入数据；2:修改数据；3:覆写数据
       datas 结构{"a":{"aa":"bb"}}
    '''
    import json
    # 读取JSON文件
    def read_json():
        try:
            with open(json_file, 'r', encoding="utf-8") as file:
                data = json.load(file)
        except: data = {}
        return data
    # 写入JSON文件
    def write_json(json_data):
        with open(json_file, 'w', encoding='utf-8') as file:
            json.dump(json_data, file, ensure_ascii=False,indent=4)
    if model == 0:
        # 读取json数据
        return read_json()
    elif model == 1:
        # 追加写入json数据
        old_datas = read_json()
        write_json(old_datas+datas)
        return old_datas+datas
    elif model == 2:
        # 修改json数据; 返回原数据
        old_datas = read_json()
        write_json(datas)
        return old_datas
    elif model == 3:
        # 覆写json数据
        old_datas = read_json()
        write_json(datas)
        return old_datas
    else:
        print("操作excel的模式不对。请对照修改 0:读取数据；1:追加写入数据；2:修改数据；3:覆写数据(清空数据，重新写入)")
        return None
    

def 获得专业和学校信息():
    '''
    @Time    :   2024/11/07 16:37:05
    @功能    :   None
    '''
    学历=random.choice(select_options['academic_qualifications_arr']['list'])
    if 学历 in ["博士", "博士后"]:
        专业 = random.choice(博士_专业)
        学校 = random.choice(博士)
    elif 学历 in ["本科", "研究生"]:
        专业 = random.choice(本科_专业)
        学校 = random.choice(普通大学)
    elif 学历 in ["技校"]:
        专业 = random.choice(职高_专业)
        学校 = random.choice(技校)
    elif 学历 in ["中专"]:
        专业 = random.choice(专科_专业)
        学校 = random.choice(中专)
    elif 学历 in ["大专"]:
        专业 = random.choice(专科_专业)
        学校 = random.choice(大专)
    elif 学历 in ["职高"]:
        专业 = random.choice(职高_专业)
        学校 = random.choice(职高)
    else:
        专业 = "无"
        学校 = "无"
    
    return 学历, 专业, 学校


def 拆分个人信息数据(data:dict):
    '''
    @Time    :   2024/11/11 10:54:49
    @功能    :   将个人信息数据进行拆分
    '''
    def 格式化资产信息(only_key:str, datas:list, type:int, init_keys:list, key:str):
        资产_keys = ["类型","是否有贷款","是否在自己名下","城市","详细地址","车品牌","其他"]
        资产_list = []
        for index, dict in enumerate(datas):
            tmp = {
                "id": index,
                "用户唯一标识": only_key,
                "类型": type
            }
            for key in 资产_keys:
                if key in init_keys: 
                    tmp[key] = ""
                else: 
                    tmp[key] = dict[key]
            资产_list.append(tmp)
        if len(资产_list) > 1 and 资产_list[-1]["是否有贷款"]=="无房":
            资产_list = 资产_list[1:]
        return 资产_list
    
    data = {
        "id": 2,
        "用户唯一标识": "葛楠_1995-11-11_2024-11-11",
        "姓名": "葛楠",
        "性别": "女",
        "外貌": "一般",
        "住址": "吴集镇xxx村",
        "性格": [
            "真诚",
            "依赖"
        ],
        "婚姻状况": "丧偶",
        "出生日期": "1995-11-11",
        "年龄": 29,
        "照片": {
            "照片列表": [],
            "是否公开": "不公开",
            "默认显示下标": -1
        },
        "身高": 175,
        "体重": 46,
        "学历": "职高",
        "专业": "服装设计与工艺",
        "学校": "淮安市华丰职业技术学校",
        "教育补充": [
            "无"
        ],
        "房产": [
            {
                "贷款": "有房有贷款",
                "城市": "南京",
                "详细地址": "这是一个测试后期可以补充3"
            }
        ],
        "车": [
            {
                "贷款": "无车",
                "品牌": "无"
            }
        ],
        "月收入": 8821,
        "年收入": 15,
        "工作类型": "教师",
        "工作单位": "沭阳汇丰饭店",
        "工作城市": "沭阳",
        "希望安家城市": "沭",
        "其他": "",
        "兴趣爱好": [
            "烧菜",
            "旅游"
        ],
        "是否喝酒": "喝",
        "是否吸烟": "吸烟",
        "父亲": {
            "关系": "父亲",
            "婚姻状况": "已婚",
            "是否健康": "健康",
            "是否退休": "未退休",
            "工作类型": "打工",
            "月收入": 9000,
            "年收入": 108000,
            "其他":""
        },
        "母亲": {
            "关系": "母亲",
            "婚姻状况": "已婚",
            "是否健康": "健康",
            "是否退休": "未退休",
            "工作类型": "打工",
            "月收入": 9000,
            "年收入": 108000,
            "其他":""
        },
        "兄弟姐妹": [
            {
                "关系": "弟弟",
                "婚姻状况": "丧偶",
                "是否健康": "健康",
                "是否退休": "未退休",
                "工作类型": "科技工作者",
                "工作城市":"",
                "月收入": 5596,
                "年收入": 16,
                "其他":""
            },
            {
                "关系": "妹妹",
                "婚姻状况": "未婚",
                "是否健康": "健康",
                "是否退休": "未退休",
                "工作类型": "务农",
                "工作城市":"",
                "月收入": 6774,
                "年收入": 12,
                "其他":""
            }
        ],
        "子女信息":[
            {
                "关系": "子",
                "性别": "男",
                "年龄": "5",
                "是否在身边": "在",
                "对方是否出抚养费": "是",
                "其他补充":""
            }
        ]
    }
    keys = ["id","用户唯一标识","性别","住址","婚姻状况","外貌","照片","性格","出生日期","教育补充","年龄",
            "是否公开照片","身高","体重","学历","专业","学校","月收入","年收入","工作类型",
            "工作单位","工作城市","希望安家城市","其他","兴趣爱好","是否喝酒","是否吸烟"]
    个人基本信息 = {key:data[key] for key in data.keys() if key not in keys}

    房产_list = 格式化资产信息(data["用户唯一标识"], data["房产"], 0, ["车品牌"], "无房")
    车_list = 格式化资产信息(data["用户唯一标识"], data["车"], 1, ["城市", "详细地址"], "无车")
    资产信息 = []
    for index, dict in enumerate(房产_list+车_list):
        dict["id"] = index
        资产信息.append(dict)
    
    父母兄弟信息 = []
    父母兄弟_keys = ["关系","婚姻状况","是否健康","是否退休","月收入","年收入","工作类型","工作城市","其他"]
    for index, dict in enumerate([data["父亲"]+data["母亲"]]+data["兄弟姐妹"]):
        tmp = {
            "id": index,
            "用户唯一标识": data["用户唯一标识"]
        }
        for key in 父母兄弟_keys:
            tmp[key] = dict[key]
        父母兄弟信息.append(tmp)

    子女信息_简版 = []
    子女信息_简版_keys = ["关系","性别","年龄","是否在身边","对方是否出抚养费","其他补充"]
    for index, dict in enumerate(data["子女信息"]):
        tmp = {
            "id": index,
            "用户唯一标识": data["用户唯一标识"],
        }
        for key in 子女信息_简版_keys:
            tmp[key] = dict[key]
        子女信息_简版.append(tmp)

    time_str = time.strftime('%Y-%m-%d %H:%M:%S',time.localtime(time.time()))
    # 如果在数据库中找不到这条件了，则说明首次写入，不创建个人信息和要求的修改记录
    个人信息和要求修改记录 = [
        {
            "id": 0,
            "用户唯一标识": data["用户唯一标识"],
            "类型":"0",
            "修改时间": "2024-11-10 18：05：40",
            "修改前所有字段内容":f"{个人基本信息};;;{资产信息};;;{父母兄弟信息};;;{子女信息_简版}",
            "修改后所有字段内容":f"{个人基本信息};;;{资产信息};;;{父母兄弟信息};;;{子女信息_简版}",
            "说明": "这里记录着用户对个人信息和个人要求的每次修改，通过用户唯一标识形成关联"
        }
    ]


拆分个人信息数据({})
def 拆分个人要求数据(data:dict):
    '''
    @Time    :   2024/11/11 10:54:49
    @功能    :   将个人要求数据进行拆分
    '''
    data = {
        "id": 2,
        "用户唯一标识": "葛楠_1995-11-11_2024-11-11",
        "性别": "男",
        "婚姻状况": [
            "离异",
            "离异",
            "丧偶"
        ],
        "外貌": [
            "无要求"
        ],
        "性格": [
            "诚实"
        ],
        "出生日期": [
            "根据最小年龄自动生成",
            "根据最大年龄自动生成"
        ],
        "年龄": [
            26,
            32
        ],
        "是否公开照片": "公开",
        "身高": [
            172,
            178
        ],
        "体重": [
            41,
            51
        ],
        "学历": "博士后",
        "专业": "生物医学工程",
        "学校": "无",
        "房产": {
            "贷款": "有房无贷款",
            "城市": "沭阳",
            "详细地址": "这是一个测试后期可以补充0"
        },
        "车": {
            "贷款": "无车",
            "品牌": "长城"
        },
        "月收入": [
            7821,
            9821
        ],
        "年收入": [
            13,
            17
        ],
        "工作类型": [
            "护士",
            "护士",
            "护士",
            "务农"
        ],
        "工作单位": "沭阳天能电池",
        "工作城市": "沭阳",
        "希望安家城市": "沭",
        "其他": "",
        "兴趣爱好": [
            "看书",
            "看书"
        ],
        "是否喝酒": "喝",
        "是否吸烟": "吸烟",
        "父亲": {
            "关系": "父亲",
            "婚姻状况": "已婚",
            "是否健康": "健康",
            "是否退休": "未退休",
            "工作类型": ["公务员","科技工作者","医生"],
            "工作城市": "沭阳",
            "月收入": [
                8000,
                10000
            ],
            "年收入": [
                98000,
                118000
            ]
        },
        "母亲": {
            "关系": "母亲",
            "婚姻状况": "已婚",
            "是否健康": "健康",
            "是否退休": "未退休",
            "工作类型": ["公务员","科技工作者","医生"],
            "工作城市": "沭阳",
            "月收入": [
                8000,
                10000
            ],
            "年收入": [
                98000,
                118000
            ]
        },
        "兄弟姐妹": [
            {
                "关系": "弟弟",
                "婚姻状况": "未婚",
                "是否健康": "健康",
                "是否退休": "未退休",
                "工作类型": "独立创业者",
                "工作城市": "沭阳",
                "月收入": [0,0],
                "年收入": [0,0]
            },
            {
                "关系": "妹妹",
                "婚姻状况": "丧偶",
                "是否健康": "健康",
                "工作类型": "教师",
                "工作城市": "沭阳",
                "月收入": [0,0],
                "年收入": [0,0]
            },
            {
                "关系": "弟弟",
                "婚姻状况": "未婚",
                "是否健康": "健康",
                "工作类型": "务农",
                "工作城市": "沭阳",
                "月收入": [0,0],
                "年收入": [0,0]
            },
            {
                "关系": "妹妹",
                "婚姻状况": "丧偶",
                "是否健康": "健康",
                "工作类型": "金融工作者",
                "工作城市": "沭阳",
                "月收入": [0,0],
                "年收入": [0,0]
            }
        ]
    }
    keys = ["id","用户唯一标识","性别","婚姻状况","外貌","性格","出生日期","年龄",
            "是否公开照片","身高","体重","学历","专业","学校","房产","车","月收入","年收入","工作类型",
            "工作单位","工作城市","希望安家城市","其他","兴趣爱好","是否喝酒","是否吸烟"]
    个人基本要求 = {}
    for key in data.keys():
        if key in keys:
            个人基本要求[key] = data[key]

    父母兄弟姐妹要求 = []
    父母兄弟_keys = ["关系","婚姻状况","是否健康","是否退休","月收入","年收入","工作类型","工作城市","其他"]
    for index, dict in enumerate([data["父亲"], data['母亲']]+data["兄弟姐妹"]):
        tmp = {
            "id": index,
            "用户唯一标识": data["用户唯一标识"]
        }
        for key in 父母兄弟_keys:
            tmp[key] = dict[key]
    父母兄弟姐妹要求.append(tmp)

    pass

拆分个人要求数据({})
# 根据虚岁计算出生日期(25)
# 根据出生日期计算周岁和虚岁("2000-01-01")
# 调用函数生成100个名字
names = 生成指定数量的姓名()

names = ['凤欣然', '司马司空成', '葛楠', '伏明', '司徒梓萱', '周萍', '史涛', '令狐思远', '西门杰', '水瑾萱', 
 '伍欣怡', '余俊杰', '左丘敏', '伍秀', '宰父宇泽', '长孙瑞', '舒宇泽', '微生梓萱', '北门思涵', 
 '奚梓萱', '余瑾瑜', '贝成艳', '陶若曦', '茅思琪', '公良宇航', '倪宇辰', '余思博', 
 '钟思涵', '计雨', '慕容思琪']
time_str = time.strftime('%Y-%m-%d',time.localtime(time.time()))
all_datas = {"information":[],"request":[],}
for index, name in enumerate(names):
    print(name)
    年龄=random.randint(年龄_列表[0], 年龄_列表[1]) 
    性别=random.choice(select_options['sex_arr']['list'])
    出生日期=根据周岁计算出生日期(年龄)
    工作城市 = random.choice(工作城市_列表)
    父母月收入 = random.randint(父母月收入_字典[random.choice(工作城市_列表)][0], 父母月收入_字典[random.choice(工作城市_列表)][1])
    兄弟姐妹_list = []
    key = f"{name}_{出生日期}_{time_str}"
    for i in range(random.randint(0, 4)):
        兄弟姐妹_list.append({
            "关系":random.choice(select_options['brothers_arr']['list']),
            "婚姻状况":random.choice(select_options['marital_status']['list']),
            "是否健康":"健康",
            "工作类型":random.choice(select_options['work_type_arr']['list']),
            "月收入":random.randint(月收入_字典[工作城市][0], 月收入_字典[工作城市][1]),
            "年收入":random.randint(年收入_字典[工作城市][0],年收入_字典[工作城市][1])
        })
    贷款=random.choice(select_options['house_loan_arr']['list'])
    房产_list = []
    if 贷款 != "无房":
        new_房产_列表 = [value for value in select_options['house_loan_arr']['list'] if value!="无房" ]
        for j, value in enumerate(random.choices(new_房产_列表, k=random.randint(1,3))):
            房产_list.append({
                "贷款":value,
                "城市":random.choice(希望安家城市_列表),
                "详细地址":f"这是一个测试后期可以补充{random.randint(0,4)}"
            })
    else:
        房产_list.append({
            "贷款":贷款,
            "城市":random.choice(希望安家城市_列表),
            "详细地址":f"这是一个测试后期可以补充{random.randint(0,4)}"
        })

    车贷=random.choice(select_options['car_loan_arr']['list'])
    车_list = []
    if 车贷 != "无车":
        new_车_列表 = [value for value in select_options['car_loan_arr']['list'] if value!="无车" ]
        for j, value in enumerate(random.choices(new_车_列表, k=random.randint(1,3))):
            车_list.append({
                "贷款": value,
                "品牌":random.choice(车品牌_列表)
            })
    else:
        车_list.append({
                "贷款": 车贷,
                "品牌":"无"
            })

    学历, 专业, 学校 = 获得专业和学校信息()
    information_counts = len(all_datas['information'])
    if information_counts == 0:
        id = index
    else:
        id = all_datas['information'][information_counts-1]["id"]+1
    data = {
        "id":id,
        "用户唯一标识":key,
        "姓名":name,
        "性别":random.choice(select_options['sex_arr']['list']),
        "外貌":random.choice(select_options['appearance_arr']['list']),
        "住址":random.choice(住址_列表),
        "性格": random.choices(select_options['temperament_arr']['list'],k=random.randint(1,5)),
        "婚姻状况":random.choice(select_options['marital_status']['list']),
        "出生日期":出生日期,
        "年龄":年龄,
        "照片":{
            "照片列表":[],
            "是否公开":"不公开",
            "默认显示下标":-1
        },
        "身高":random.choice(身高_字典[性别]),
        "体重":random.choice(体重_字典[性别]),
        "学历":学历,
        "专业":专业,
        "学校":学校,
        "教育补充":["无"],
        "房产":房产_list,
        "车":车_list,
        "月收入":random.randint(月收入_字典[工作城市][0], 月收入_字典[工作城市][1]),
        "年收入":random.randint(年收入_字典[工作城市][0],年收入_字典[工作城市][1]),
        "工作类型":random.choice(select_options['work_type_arr']['list']),
        "工作单位":random.choice(工作单位_字典[工作城市]),
        "工作城市":工作城市,
        "希望安家城市":random.choice(工作城市),
        "其他":"",
        "兴趣爱好":random.choices(兴趣爱好_列表, k=2),
        "是否喝酒":random.choice(是否喝酒_列表),
        "是否吸烟":random.choice(是否吸烟_列表),
        "父亲":{
            "关系": "父亲",
            "是否健康":"健康",
            "婚姻状况":"已婚",
            "是否退休":"未退休",
            "工作类型":"打工",
            "月收入":父母月收入,
            "年收入":父母月收入*12
        },
        "母亲":{
            "关系": "母亲",
            "是否健康":"健康",
            "婚姻状况":"已婚",
            "是否退休":"未退休",
            "工作类型":"打工",
            "月收入":父母月收入,
            "年收入":父母月收入*12
        },
        "兄弟姐妹":兄弟姐妹_list
    }
    
    要求_婚姻状况 = []
    for i in range(random.randint(1,3)):
        要求_婚姻状况.append(random.choice(select_options['marital_status']['list']))

    学历, 专业, 学校 = 获得专业和学校信息()

    贷款=random.choice(select_options['house_loan_arr']['list'])
    if 贷款 != "无房":
        房产_dict={
            "贷款":random.choice(select_options['house_loan_arr']['list']),
            "城市":random.choice(希望安家城市_列表),
            "详细地址":f"这是一个测试后期可以补充{random.randint(0,4)}"
        }
    else:
        房产_dict={
            "贷款":"无房",
            "城市":random.choice(希望安家城市_列表),
            "详细地址":f"空"
        }
    车贷=random.choice(select_options['car_loan_arr']['list'])
    if 车贷 != "无车":
        车_dict={
            "贷款":random.choice(select_options['car_loan_arr']['list']),
            "品牌":random.choice(车品牌_列表)
        }
    else:
        车_dict = {
            "贷款":"无车",
            "品牌":"空"
        }

    兄弟姐妹_list = []
    for i in range(random.randint(0, 4)):
        兄弟姐妹_list.append({
            "关系":random.choice(select_options['brothers_arr']['list']),
            "婚姻状况":random.choice(select_options['marital_status']['list']),
            "是否健康":"健康",
            "工作类型":random.choice(select_options['work_type_arr']['list']),
            "月收入":random.randint(月收入_字典[工作城市][0], 月收入_字典[工作城市][1]),
            "年收入":random.randint(年收入_字典[工作城市][0],年收入_字典[工作城市][1])
        })
    外貌 = random.choices(select_options['appearance_arr']['list']+["无要求"], k=3)
    if "无要求" in 外貌:外貌 = ["无要求"]
    要求_data = {
            "id":id,
            "用户唯一标识":key,
            "性别":select_options['sex_arr']['list'][0] if select_options['sex_arr']['list'][0] != data["性别"] else select_options['sex_arr']['list'][1],
            "婚姻状况":要求_婚姻状况,
            "外貌":外貌,
            "性格": random.choices(select_options['temperament_arr']['list'],k=random.randint(1,5)),
            "出生日期":["根据最小年龄自动生成","根据最大年龄自动生成"],
            "年龄":[data['年龄']-3, data['年龄']+3],
            "是否公开照片":random.choice(["公开","不公开"]),
            "身高":[data['身高']-3,data['身高']+3],
            "体重":[data['体重']-5,data['体重']+5],
            "学历":学历,
            "专业":专业,
            "学校":"无",
            "房产":房产_dict,
            "车":车_dict,
            "月收入":[data['月收入']-1000, data['月收入']+1000],
            "年收入":[data['年收入']-2,data['年收入']+2],
            "工作类型":random.choices(select_options['work_type_arr']['list'], k=4),
            "工作单位":random.choice(工作单位_字典[工作城市]),
            "工作城市":工作城市,
            "希望安家城市":random.choice(工作城市),
            "其他":"",
            "兴趣爱好":random.choices(兴趣爱好_列表, k=2),
            "是否喝酒":random.choice(是否喝酒_列表+["无要求"]),
            "是否吸烟":random.choice(是否吸烟_列表+["无要求"]),
            "父亲":{
                "是否健康":"健康",
                "是否退休":"未退休",
                "工作类型":"打工",
                "月收入":[父母月收入-1000, 父母月收入+1000],
                "年收入":[父母月收入*12-10000, 父母月收入*12+10000]
            },
            "母亲":{
                "是否健康":"健康",
                "是否退休":"未退休",
                "工作类型":"打工",
                "月收入":[父母月收入-1000, 父母月收入+1000],
                "年收入":[父母月收入*12-10000, 父母月收入*12+10000]
            },
            "兄弟姐妹":兄弟姐妹_list
        }
    
    all_datas["information"].append(data)
    all_datas["request"].append(要求_data)
    all_datas["fieldMapping"] = {
        "id":"id",
        "用户唯一标识":"onlyKey",
        "姓名":"name",
        "性别":"sex",
        "住址":"address",
        "外貌":"appearance",
        "性格":"temperament",
        "婚姻状况":"maritalStatus",
        "出生日期":"birthDate",
        "年龄":"age",
        "照片":"photos",
        "照片列表":"photosList",
        "是否公开":"photosPublic",
        "默认显示下标":"photosIndex",
        "身高":"height",
        "体重":"weight",
        "学历":"education",
        "专业":"major",
        "学校":"school",
        "教育补充":"educational_supplements",
        "房产":"house",
        "房产贷款":"houseLoan",
        "城市":"houseCity",
        "详细地址":"houseAddress",
        "车":"car",
        "车贷款":"carLoan",
        "品牌":"carBrands",
        "月收入":"monthIncome",
        "年收入":"yearIncome",
        "工作类型":"workType",
        "工作单位":"workUnit",
        "工作城市":"workCity",
        "希望安家城市":"preferredHomeCity",
        "其他":"other",
        "兴趣爱好":"hobbies",
        "是否喝酒":"drinking_or_not",
        "是否吸烟":"smorking_or_not",
        "家庭情况":"familySituation",
        "父亲":"father",
        "父亲是否健康":"fatherHealthy",
        "父亲是否退休":"fatherRetired",
        "父亲工作类型":"fatherWork",
        "父亲月收入":"fatherMonthIncome",
        "父亲年收入":"fatherYearIncome",
        "母亲":"mother",
        "母亲是否健康":"motherHealthy",
        "母亲是否退休":"motherRetired",
        "母亲工作类型":"motherWork",
        "母亲月收入":"motherMonthIncome",
        "母亲年收入":"motherYearIncome",
        "兄弟姐妹":"siblings",
        "兄弟姐妹关系":"siblingsRelationship",
        "兄弟姐妹婚姻状况":"siblingsMaritalStatus",
        "兄弟姐妹是否健康":"siblingsHealthy",
        "兄弟姐妹工作类型":"siblingsWork",
        "兄弟姐妹月收入":"siblingsMonthIncome",
        "兄弟姐妹年收入":"siblingsYearIncome"
    }
    all_datas["showFields"] = [
        {"list":["姓名",
        "性别",
        "住址",
        "婚姻状况",
        "出生日期",
        "年龄",
        "外貌",
        '性格',
        "身高",
        "体重",
        "学历",
        "专业",
        "学校",
        "房产贷款",
        "所在城市",
        "详细地址",
        "车贷款",
        "品牌",
        "月收入",
        "年收入",
        "工作类型",
        "工作城市",
        "希望安家城市",
        "兴趣爱好",
        "是否喝酒",
        "是否吸烟"]}
    ]
    
    all_datas["select_options"] = select_options
    all_datas['表说明'] = {
        "information":"这里存储着用户的基本信息，最重要的一张表",
        "资产信息登记":"这里存储着被关心的资产信息，通过用户唯一标识形成关联",
        "ParentsAndBrothers":"这里记是录着每个用户的家庭情况的详细版本，爸爸妈妈兄弟姐妹，每一个人都是一条独立的记录，通过用户唯一标识形成关联",
        "childrens":"这里是记录着用户子女情况的详细版本，每个子女都生成一条独立记录，通过用户唯一标识形成关联",
        "匹配情况":"这里记录着用户每次的匹配情况，通过用户唯一标识和匹配用户唯一标识形成关联",
        "评价记录":"这里记录着用户和被匹配对象相互评论，同时记录着红娘的评论，通过用户唯一标识和匹配用户唯一标识形成关联",
        "红娘追踪记录":"这里记录着红娘对男女方的回访和督促情况，通过用户唯一标识和匹配用户唯一标识形成关联",
        "个人信息和要求修改记录":"这里记录着用户对个人信息和个人要求的每次修改，通过用户唯一标识形成关联",
        "request":"个人要求的基本信息，通过用户唯一标识形成关联",
        "requestParentsAndBrothers":"这里记录着用户对匹配对象家庭的要求，通过用户唯一标识形成关联",
        "fieldMapping":"中文和英文字段对义表",
        "showFields":"将在表格中显示的字段",
        "select_options":"相关希腊列表的内容",
        "红娘基本信息":"这里记录着红娘的基本信息",
        "个人相册表":"存储个人上传的相片的路径和是否公开的标记",
    }
    
读写json数据(rf"C:\Dropbox\YAN\D\2024_web\yuan\制造模拟数据.json", all_datas, 3)

